Revit 2027 API
Mesh.MaterialElementId Property
Element ID of the material from which this mesh is composed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId MaterialElementId { get; }
Public ReadOnly Property MaterialElementId As ElementId
	Get
public:
property ElementId^ MaterialElementId {
	ElementId^ get ();
}
member MaterialElementId : ElementId with get
Property Value
ElementId
See Also
Reference
Mesh Class
Autodesk.Revit.DB Namespace